sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include <stdlib.h>
#include <string.h> //for memcpy and memcmp

#include "..\\..\\Common\\led.h"
#include "..\\..\\Common\\SensorFusion.h"
#include "..\\..\\Common\\gy8x.h"
#include "..\\..\\Common\\nrf24l01.h"
#include "..\\..\\Common\\usb.h"
#include "..\\..\\Common\\eeprom_flash.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

int8_t ctlSource = HMD_SOURCE;
SensorData tSensorData;
int32_t blinkDelay = 1000;
USBPacket USBDataPacket = {0};
extern uint8_t USB_RX_Buffer[CUSTOM_HID_EPIN_SIZE];
USBPacket *pUSBCommandPacket = (USBPacket *) USB_RX_Buffer;
//volatile uint8_t rfReady = 1;
uint8_t rfStatus = 0;
bool sensorStatus = false;

#if CUSTOM_HID_EPOUT_SIZE != 32
#error HID out packet size not 32
#end
#elif CUSTOM_HID_EPIN_SIZE != 32
#error HID packet in size not 32
#end
#elif USB_CUSTOM_HID_DESC_SIZ != 34
#error HID packet size not 34
#end
#endif

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_SPI2_Init(void);
static void MX_I2C2_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
RF_InitTypeDef RF_InitStruct = {0};
unsigned char TrackedDevice_NRF24L01_Init (void)
{	
	RF_InitStruct.RF_Power_State=RF_Power_On;
	RF_InitStruct.RF_Config=RF_Config_IRQ_RX_Off|RF_Config_IRQ_TX_Off|RF_Confing_IRQ_Max_Rt_Off;
	RF_InitStruct.RF_CRC_Mode=RF_CRC8_On;
	RF_InitStruct.RF_Mode=RF_Mode_RX;
	RF_InitStruct.RF_Pipe_Auto_Ack=0;	
	RF_InitStruct.RF_Enable_Pipe=1;	
	RF_InitStruct.RF_Setup=RF_Setup_5_Byte_Adress;
	RF_InitStruct.RF_TX_Power=RF_TX_Power_High;
	RF_InitStruct.RF_Data_Rate=RF_Data_Rate_2Mbs;
	RF_InitStruct.RF_Channel=250;
	RF_InitStruct.RF_TX_Adress[0]='B';
	RF_InitStruct.RF_TX_Adress[1]='A';
	RF_InitStruct.RF_TX_Adress[2]='S';
	RF_InitStruct.RF_TX_Adress[3]='E';
	RF_InitStruct.RF_TX_Adress[4]='1';
	RF_InitStruct.RF_RX_Adress_Pipe0[0]='C';
	RF_InitStruct.RF_RX_Adress_Pipe0[1]='T';
	RF_InitStruct.RF_RX_Adress_Pipe0[2]='R';
	RF_InitStruct.RF_RX_Adress_Pipe0[3]='L';
	RF_InitStruct.RF_RX_Adress_Pipe0[4]='0';
	RF_InitStruct.RF_Payload_Size_Pipe0=32;
	RF_InitStruct.RF_Auto_Retransmit_Count=0;
	RF_InitStruct.RF_Auto_Retransmit_Delay=0;
	return RF_Init(&hspi2, &RF_InitStruct);
}	
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

uint64_t HAL_GetMicros()
{
	uint64_t ticks = HAL_GetTick();
	uint64_t systick = (uint64_t)SysTick->VAL;
	return (ticks * 1000ull) + 1000ull - (systick / 72ul);
}

void HAL_MicroDelay(uint64_t delay)
{
	uint64_t tickstart = 0;	
	tickstart = HAL_GetMicros();
	while((HAL_GetMicros() - tickstart) < delay)
	{
	}
}

inline uint8_t sgn(float n)
{
	return (n<0?-1:1);
}

volatile uint16_t DigitalValues = 0;
uint16_t DigitalCache = 0;

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	switch(GPIO_Pin)
	{
		case IR_SENS0_Pin:
			break;
		case IR_SENS1_Pin:
			break;
		case IR_SENS2_Pin:
			break;
		case IR_SENS3_Pin:
			break;
		case IR_SENS4_Pin:
			break;
		case IR_SENS5_Pin:
			break;
		case CTL_BTN0_Pin:
			if (HAL_GPIO_ReadPin(CTL_BTN0_GPIO_Port, CTL_BTN0_Pin) == GPIO_PIN_SET)
				DigitalValues |= BUTTON_0;
			else
				DigitalValues &= ~BUTTON_0;
			break;
		case CTL_BTN1_Pin:
			if (HAL_GPIO_ReadPin(CTL_BTN1_GPIO_Port, CTL_BTN1_Pin) == GPIO_PIN_SET)
				DigitalValues |= BUTTON_1;
			else
				DigitalValues &= ~BUTTON_1;
			break;
		case CTL_BTN2_Pin:
			if (HAL_GPIO_ReadPin(CTL_BTN2_GPIO_Port, CTL_BTN2_Pin) == GPIO_PIN_SET)
				DigitalValues |= BUTTON_2;
			else
				DigitalValues &= ~BUTTON_2;
			break;
		case CTL_BTN3_Pin:
			if (HAL_GPIO_ReadPin(CTL_BTN3_GPIO_Port, CTL_BTN3_Pin) == GPIO_PIN_SET)
				DigitalValues |= BUTTON_3;
			else
				DigitalValues &= ~BUTTON_3;
			break;
	}
}

volatile uint32_t ADC_Values[3] = {0};

float ADC_Averages[3] = {0};
float ADC_Offsets[3] = {0};
int32_t ADC_Cache[3] = {0};

uint64_t lastRotationUpdate = 0; 
uint64_t now = 0;        
uint32_t nextSend = 0; 

uint32_t sndCounter = 0;
uint32_t rcvCounter = 0;

