sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
		if (vibrationStopTime && HAL_GetTick() > vibrationStopTime)			
		{
			HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_RESET);
			vibrationStopTime = 0;
		}
		
		float elapsedTime = (now - lastRotationUpdate) / 1000000.0f; // set integration time by time elapsed since last filter update				
		
		if (elapsedTime >= 0.005f) //update at 200hz
		{	
			hasRotationData |= readAccelData(tSensorData.Accel.Raw);  // Read the x/y/z adc values			
			hasRotationData |= readGyroData(tSensorData.Gyro.Raw); 
			hasRotationData |= readMagData(tSensorData.Mag.Raw);
					
			
			if (hasRotationData) // recalc position if still has position data to be sent
			{
				tSensorData.Accel.ProcessNew();
				tSensorData.Gyro.ProcessNew();
				tSensorData.Mag.ProcessNew();
				
				tSensorData.TimeElapsed = elapsedTime;
				lastRotationUpdate = now;	
				orientQuat = orientFuse.FuseOrient(&tSensorData);						

				//gravQuat = orientQuat;
//				gravQuat.w = 0; gravQuat.x = 0; gravQuat.y = 0; gravQuat.z = 0;
//				gravQuat = (orientQuat * gravQuat) * orientQuat.conjugate();

				if (isPositionReady && (hasPositionData || (isCalibrated && (now >= 10000000))))
				{
					//float elapsedPositionTime = (float)(now - lastPositionIntegrateTime) / 1000000.0f;
					//if (elapsedPositionTime >= 0.001f) // integrate every 2 ms
					{
						GravityVector[0] = 2.0f * (orientQuat.x * orientQuat.z - orientQuat.w * orientQuat.y);
						GravityVector[1] = 2.0f * (orientQuat.w * orientQuat.x + orientQuat.y * orientQuat.z);
						GravityVector[2] = orientQuat.w * orientQuat.w - orientQuat.x * orientQuat.x - orientQuat.y * orientQuat.y + orientQuat.z * orientQuat.z;
						
						for (int i=0; i<3; i++)
						{
							float prevAccel = CompAccelVector[i];
							float prevVelocity = VelocityVector[i];																									
							float newAccel = tSensorData.Accel.Converted[i] - GravityVector[i];
							float newVelocity = ((prevAccel + newAccel) / 2.0f) * 9.81f * elapsedTime;		
							float prevPosition = position.Position[i];
							
							//if velocity changes direction hold for a moment
//							if (sgn(prevVelocity) != sgn(newVelocity))
//							{
//								newVelocity = prevVelocity = 0;
//								//newAccel = 0;
//							}
							
							
							position.Position[i] = prevPosition + ((prevVelocity + newVelocity) / 2.0f) * elapsedTime * 10.0f;											
							CompAccelVector[i] = newAccel;
							VelocityVector[i] = prevVelocity + newVelocity;							
						}	
						
						//if (now - lastPositionSend >= 20000) //50 ms
						{
							positionQuat.w = 0;
							positionQuat.x = position.Position[0];
							positionQuat.y = position.Position[1];
							positionQuat.z = position.Position[2];
							
							positionQuat = (orientQuat * positionQuat) * orientQuat.conjugate();
							
							hasPositionData = 1;							
							//lastPositionSend = now;	
						}
						
						//lastPositionIntegrateTime = now;
					}
				}
				//else
				//	lastPositionIntegrateTime = now;
			}
		}

		rfStatus = RF_Status(&hspi2);
		readyToReceive = (rfStatus & RF_RX_DR_IRQ_CLEAR) == RF_RX_DR_IRQ_CLEAR ? 1 : 0;

		if (readyToReceive)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToReceive = (rfStatus & RF_RX_FIFO_EMPTY_Bit) == 0x00 ? 1: 0;
			while (readyToReceive)
			{			
				rcvCounter++;
				//receive command
				//has fifo, receive
				readyToReceive = RF_ReceivePayload(&hspi2, (uint8_t*)pUSBCommandPacket, sizeof(USBPacket)) == 0 ? 1: 0; //if not empty 
				
				if (CheckPacketCrc(pUSBCommandPacket) && ((pUSBCommandPacket->Header.Type & 0x0F)) == ctlSource)
				{
					if (lastCommandSequence != pUSBCommandPacket->Header.Sequence) //discard duplicates
					{
						lastCommandSequence = pUSBCommandPacket->Header.Sequence; 
						switch (pUSBCommandPacket->Command.Command)
						{
							case CMD_RAW_DATA:								
								feedRawData = pUSBCommandPacket->Command.Data.Raw.State;
								break;
							case CMD_VIBRATE:
								vibrationStopTime = HAL_GetTick() + pUSBCommandPacket->Command.Data.Vibration.Duration;
								HAL_GPIO_WritePin(CTL_VIBRATE_GPIO_Port, CTL_VIBRATE_Pin, GPIO_PIN_SET);							
								break;
							case CMD_CALIBRATE:
								//manually set sensor offsets
								int sensorId = pUSBCommandPacket->Command.Data.Calibration.Sensor;								
								if (sensorId == SENSOR_NONE)
								{
									isCalibrated = true;
									calibrationCache.Magic = VALID_EEPROM_MAGIC;
									enableEEPROMWriting();
									char *eepromData = (char *)&calibrationCache;	
									int addr = 0;
									for (int i=0; i<sizeof(calibrationCache); i+=sizeof(uint32_t))
									{
										writeEEPROMWord(addr, *((uint32_t *)(&eepromData[i])));
										addr += sizeof(uint32_t);
									}
									disableEEPROMWriting();
								}
								else
								{									
									for (int i=0; i<3; i++)
									{
										position.Position[i] = 0;
										VelocityVector[i] = 0;
										//AccelVector[i] = 0;
										CompAccelVector[i] = 0;
									}
									if (sensorId == SENSOR_ACCEL)
									{
										for (int i=0; i<3; i++)
										{
											tSensorData.Accel.PosScale[i] = (1.0f / aRes) / (float)pUSBCommandPacket->Command.Data.Calibration.PosScale[i];
											tSensorData.Accel.NegScale[i] = (1.0f / aRes) / (float)pUSBCommandPacket->Command.Data.Calibration.NegScale[i];
										}
										calibrationCache.Accel = pUSBCommandPacket->Command.Data.Calibration;
									}
									else if (sensorId == SENSOR_GYRO)
									{
										for (int i=0; i<3; i++)
										{
											tSensorData.Gyro.PosScale[i] = pUSBCommandPacket->Command.Data.Calibration.PosScale[i];
											tSensorData.Gyro.NegScale[i] = 0;
										}
										calibrationCache.Gyro = pUSBCommandPacket->Command.Data.Calibration;
									}
									else if (sensorId == SENSOR_MAG)
									{
										for (int i=0; i<3; i++)
										{
											tSensorData.Mag.PosScale[i] = (1.0f / mRes) / (float)pUSBCommandPacket->Command.Data.Calibration.PosScale[i];
											tSensorData.Mag.NegScale[i] = (1.0f / mRes) / (float)pUSBCommandPacket->Command.Data.Calibration.NegScale[i];
										}
										calibrationCache.Mag = pUSBCommandPacket->Command.Data.Calibration;
									}									
								}
								//lastPositionIntegrateTime = 
								//lastPositionSend = now;
								break;
						}
					}
					pUSBCommandPacket->Header.Type = 0xff;				
				}									
			}
		}		
		
