sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
		if ((hasRotationData || feedRawData || hasPositionData || buttonRetransmit) && HAL_GetTick() >= nextSend)
		{
			rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;			
		}
		
		if (readyToSend)
		{
			RF_TransmitMode(&hspi2, RF_InitStruct.RF_TX_Adress); //switch to tx mode
			//HAL_MicroDelay(10);			
			blinkDelay = 100;

			sndCounter++;
			
			//RF_DisableTransmit(&hspi2);
			
			//rfStatus = RF_Status(&hspi2); readyToSend = (rfStatus & RF_TX_STATUS_FULL_Bit) == 0x00 ? 1 : 0;	
			sendTurn = (sendTurn + 1) % 4;
			
			//4 types of data				
			uint8_t currTurn = sendTurn;
			
			if (currTurn == 0)
			{
				if (feedRawData)
				{	
					sendTurn = currTurn;
					//send raw data
					USBDataPacket.Header.Type = ctlSource | COMMAND_DATA;
					USBDataPacket.Header.Sequence++;				
					USBDataPacket.Command.Command = CMD_RAW_DATA;
					USBDataPacket.Command.Data.Raw.State = feedRawData;
					for (int idx=0; idx<3; idx++)
					{
						switch(feedRawData)
						{
							case 1:
							{
								//raw sensor values
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Raw[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Raw[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Raw[idx];
								break;
							}
							case 2:
							{
								//filtered sensor data
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Filtered[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Filtered[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Filtered[idx];
								break;
							}
							case 3:
							{
								//compensated sensor data
								USBDataPacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Compensated[idx];
								USBDataPacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Compensated[idx];
								USBDataPacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Compensated[idx];
								break;
							}
							case 4:
							{
								//deadreckoning vectors
								USBDataPacket.Command.Data.Raw.Accel[idx] = (int16_t)(GravityVector[idx] / aRes);
								USBDataPacket.Command.Data.Raw.Gyro[idx] = (int16_t)(CompAccelVector[idx] / aRes); //in m/s2
								USBDataPacket.Command.Data.Raw.Mag[idx] = VelocityVector[idx] * 1000; //in mm/s
								break;
							}
						}
					}
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;
				}
				else 
					currTurn++;
			}
			if (currTurn == 1)
			{	
				if (hasPositionData)
				{					
					sendTurn = currTurn;
					//send position
					hasPositionData = 0;				
					USBDataPacket.Header.Type = ctlSource | POSITION_DATA;
					USBDataPacket.Header.Sequence++;
					
					//remap
					USBDataPacket.Position.Position[0] = positionQuat.x; //position.Position[0];
					USBDataPacket.Position.Position[1] = positionQuat.z; //position.Position[2];
					USBDataPacket.Position.Position[2] = -positionQuat.y; //-position.Position[1];
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;					
				}
				else 
					currTurn++;
			} 
			if (currTurn == 2)
			{				
				if (hasRotationData)
				{			
					sendTurn = currTurn;					
					//send rot data
					hasRotationData = 0;				
					USBDataPacket.Header.Type = ctlSource | ROTATION_DATA;
					USBDataPacket.Header.Sequence++;
					//remap				
					USBDataPacket.Rotation.w = orientQuat.w;
					USBDataPacket.Rotation.x = orientQuat.x;
					USBDataPacket.Rotation.y = orientQuat.z;
					USBDataPacket.Rotation.z = -orientQuat.y;					
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));
					//rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;	
				}			
				else
					currTurn++;
			} 
			if (currTurn == 3)
			{
				if (buttonRetransmit)
				{			
					sendTurn = currTurn;					
					//send trigger data				
					buttonRetransmit--;				
					USBDataPacket.Header.Type = ctlSource | TRIGGER_DATA;
					USBDataPacket.Header.Sequence++;				
					USBDataPacket.Trigger.Analog[0].x = ((float)ADC_Cache[0]) / 200.0f;
					USBDataPacket.Trigger.Analog[0].y = 0;				
					USBDataPacket.Trigger.Analog[1].x = ((float)ADC_Cache[1]) / 100.0f;
					USBDataPacket.Trigger.Analog[1].y = ((float)ADC_Cache[2]) / 100.0f;
					USBDataPacket.Trigger.Digital = DigitalCache;
					SetPacketCrc(&USBDataPacket);				
					RF_SendPayload(&hspi2, (uint8_t*)&USBDataPacket, sizeof(USBPacket));				
					rfStatus = RF_FifoStatus(&hspi2); readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;									
				}
				currTurn++;
			}			
			
			//RF_EnableTransmit(&hspi2);
			//if (!(hasRotationData | hasPositionData | buttonRetransmit | feedRawData))
			do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete			
			
			if (!(feedRawData || hasPositionData || hasRotationData || buttonRetransmit))
				nextSend = HAL_GetTick() + (extraDelay + (rand() % 10));
			readyToSend = 0;

			HAL_MicroDelay(10);
			RF_ReceiveMode(&hspi2, RF_InitStruct.RF_RX_Adress_Pipe0); //back to rx mode
			//
			//continue;
		}
	}
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

